In [1]:
import pandas as pd

In [3]:
df1=pd.DataFrame({'Name':['Vicky','Bill'],'Age':[12,46]})
df2=pd.DataFrame({'Name':['John','Sabrina'],'Age':[37,25]})
df1

    Name  Age
0  Vicky   12
1   Bill   46

In [4]:
df2

      Name  Age
0     John   37
1  Sabrina   25

In [5]:
#cancat horizontally

cars=pd.concat([df1,df2],axis=1)
cars

    Name  Age     Name  Age
0  Vicky   12     John   37
1   Bill   46  Sabrina   25

In [6]:
df3=pd.concat([df1,df2],axis=0,ignore_index=True)
df3

      Name  Age
0    Vicky   12
1     Bill   46
2     John   37
3  Sabrina   25

In [7]:
df4=pd.DataFrame({'Name':['Tyler','Natalie'],'Age':[28,39],'Hobby':['Swimming','Reading']})
df4

      Name  Age     Hobby
0    Tyler   28  Swimming
1  Natalie   39   Reading

In [8]:
pd.concat([df3,df4],join='outer',ignore_index=True)

      Name  Age     Hobby
0    Vicky   12       NaN
1     Bill   46       NaN
2     John   37       NaN
3  Sabrina   25       NaN
4    Tyler   28  Swimming
5  Natalie   39   Reading

In [9]:
#Inner
pd.concat([df3,df4], join='inner', ignore_index=True)

      Name  Age
0    Vicky   12
1     Bill   46
2     John   37
3  Sabrina   25
4    Tyler   28
5  Natalie   39

In [10]:
size=pd.DataFrame({'Colour':['Red','Blue','Green'],'Size':['M','S','M']})
gender=pd.DataFrame({'Colour':['Red','Blue','Yellow'],'Sex':['Female','Female','Male']})
size

  Colour Size
0    Red    M
1   Blue    S
2  Green    M

In [11]:
gender

   Colour     Sex
0     Red  Female
1    Blue  Female
2  Yellow    Male

In [12]:
pd.merge(size,gender,how='inner')

  Colour Size     Sex
0    Red    M  Female
1   Blue    S  Female

In [13]:
pd.merge(size,gender,how='outer')

   Colour Size     Sex
0     Red    M  Female
1    Blue    S  Female
2   Green    M     NaN
3  Yellow  NaN    Male

In [14]:
pd.merge(size,gender,how='left')

  Colour Size     Sex
0    Red    M  Female
1   Blue    S  Female
2  Green    M     NaN

In [15]:
pd.merge(size,gender,how='right')

   Colour Size     Sex
0     Red    M  Female
1    Blue    S  Female
2  Yellow  NaN    Male